Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PropertyTypes
Identical to core
libgr_attrib\interface\gr_mark_content_types.h grMarkTypes_e

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PropertyTypes.GR_LAYER
The layer element.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PropertyTypes.GR_HOLE_DEPTH
The hole depth mark element.